{
    "riders": [ 
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/4fad24cf-cf44-4636-aa43-b32a99747891/aijXUw2f.png?height=400&width=600",
            "name": "Marc Márquez", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Honda",
            "dateOfBirth": "17/02/1993",
            "placeOfBirth": "Cervera",
            "height": "169 cm",
            "story": "Marc Marquez became the youngest ever six-time World Champion after taking his fourth premier class crown in 2017. On the podium in his rookie 125 campaign in 2008, Marquez won that crown in 2010 before moving up to Moto2™ for 2011. After a tough start, the rider from Cervera went on an incredible winning spree and had closed the gap to Championship leader Stefan Bradl to a handful of points, before a crash in practice for the Malaysian GP saw Marquez forced to cede the fight and miss the two remaining races of the year. Problems with his vision in the off season saw surgery then finally fix the problem, and despite the shortened preparation for 2012 the Spaniard took the crown in stunning style by the Australian GP.    Replacing outgoing Casey Stoner in 2013 at the Repsol Honda Team, Marquez won his second ever MotoGP™ race and incredibly took the Championship in his rookie year. Then beginning 2014 with 10 wins in a row, Marquez won that crown in Motegi to successfully defend the title. Before 2015 proved more difficult with some mistakes and too many DNFs. Losing out to Jorge Lorenzo and Valentino Rossi, Marquez began 2016 with a point to prove and took another incredible Championship title – redesigning his mentality and thinking about the long game as he put consistency at the top of the agenda. The reigning Champion then fought down to the wire against Andrea Dovizioso for the 2017 crown, with everything going down to the final round and Marquez - despite an incredible moment into Turn 1 - keeping it on the podium to break another record and take another title. He began 2018 as the reigning Champion once more and went on to make more history, taking nine wins and wrapping up the title in Japan - becoming the youngest ever seven-time World Champion. 2019 saw the number 93 take yet another step up, fighting off Dovizioso once more, as well as new rivals in Alex Rins and Fabio Quartararo, with a series of tough last lap battles. After a season of only finishing second or better in every race - bar a DNF at the Circuit of the Americas - the Repsol Honda rider went on to make it Magic Number 8, needing just 15 rounds, getting the job done in Thailand.    Any hopes of another record breaking year were put on hold in 2020 however, as Marquez sustained an injury to his right humerus in the season opener in Jerez, which eventually ruled him out of the season. Thankfully, Marquez was able to return to action at Round 3 in Portimao in 2021. Slowly but surely, the number 93 regained speed and fitness and at the Sachsenring, he was back on the top step. A P2 in Aragon was followed by back-to-back victories in Austin and Misano, signalling Marquez was returning to some real form. However, a training accident caused the return of diplopia (double vision) that he suffered with in 2011. Marquez missed the last two rounds of the season and the issue struck again at the start of 2022 when he suffered one of the biggest crashes in premier class history in Indonesia. He returned at Austin but once again stepped away from the sport a few months later after the Italian GP to undergo a fourth, career-saving surgery on his right humerus. Returning for the final six rounds, Marquez clinched a first pole in three years at the Japanese Grand Prix and bagged his 100th premier class podium a fortnight later in Australia. 2023 started with a pole position and Sprint P3 in Portimao, but a Sunday crash involving Oliveira saw the #93 miss three races. The only Sunday podium came at a rain-drenched Japanese GP, but the following GP saw Marquez announce he would be leaving Honda at the end of the season. His new 2024 destination? Gresini Ducati. A mouth-watering prospect awaits this season as the eight-time World Champion races last year's title-winning machine. Can Marquez return to winning ways and fight for the title?",
            "merchandising": "https://store.motogp.com/en/marc-m%C3%A1rquez/a-4600433963+z-993183-1599304107",
            "worldChampionship": "8",
            "victories": "85",
            "podiums": "140",
            "poles": "92",
            "races": "247"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/a5b9d197-c272-45e1-8ea4-d1d5ca54ff77/YW9dAEBJ.png?height=400&width=600",
            "name": "Francesco Bagnaia", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "bike": "Ducati",
            "dateOfBirth": "14/01/1997",
            "placeOfBirth": "Torino",
            "height": "176 cm",
            "story": "Italian Francesco Bagnaia moved to the highly competitive CEV Championship in Spain in 2010, and he came third overall that year. He was reconfirmed for the Monlau Competicion team for 2012 and won another race before the step up to the World Championship, where he partnered Roman Fenati in the Team Italia FMI in 2013. For 2014 he switched teams as well as machinery as he lined up for the Sky Racing Team VR46 on a KTM, and 2015 brought another new challenge with the new Aspar Team Mahindra. Ending the year as the top Mahindra rider, the Italian was also frequently involved in the podium battle, retaining his seat for 2016 and going on to take not only a maiden win in Assen, but also a second win in Sepang. Earning a test ride on the team’s MotoGP™ machine in Valencia at the end of the season, Bagnaia moved up to Moto2™ in 2017 with the new Sky Racing Team VR46 intermediate class effort and was Rookie of the Year, taking several podiums. In 2018 he hit the ground running and was a contender for the crown from the off, with some incredible wins and consistency seeing him eventually take the title in Malaysia. Impressive in his first outings in the premier class in testing, Bagnaia moved up to MotoGP™ with Pramac Racing in 2019. It was a difficult rookie year for Bagnaia but a fantastic P4 in Australia showed plenty signs of promise. 2020 proved a mixed year for the Italian and his GP-20. He earned an impressive second place in the San Marino GP and a week later at the same track, he was on the verge of a maiden premier class victory until a heartbreaking slide off the track ended his hopes. He never quite got going again in the remaining races but 2021 brought renewed hope for Pecco in the factory squad. Three podiums and a pole at the opening four rounds signalled the Italian as a title contender and, despite a blip in the middle of the season, he finished the year as the form man of the Championship. A debut MotoGP™ win came at Aragon after an incredible head-to-head with Marc Marquez, and he backed it up with victory in Misano a week after. His title charge slipped through his fingers with a crash during our second visit to Misano, but he did add victories at the final two rounds of the year. The Italian's 2022 season got off to a slow start and a crash at the Sachsenring left him 91 points away from the Championship lead, before a stellar run in the second half of the campaign saw Bagnaia do what once seemed impossible and clinch his first premier class crown in Valencia. Sporting the number 1 in 2023, Bagnaia managed to fend off Jorge Martin at the season finale to become the first rider to successfully defend the #1 plate since Mick Doohan, and joined Valentino Rossi and Marc Marquez in becoming the only riders in MotoGP™ to win back-to-back titles.",
            "merchandising": "https://store.motogp.com/content/ws/all/6b30f000-4952-4f7f-a073-dfa85f543113__267X370.png",
            "worldChampionship": "3",
            "victories": "28",
            "podiums": "58",
            "poles": "25",
            "races": "192"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/287d5a3c-1c63-449f-b9be-8e141219cb9e/kComPhrd.png?height=400&width=600",
            "name": "Enea Bastianini", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "bike": "Ducati" ,
            "dateOfBirth": "30/12/1997",
            "placeOfBirth": "Rimini",
            "height": "168 cm",
            "story": "Enea Bastianini was victorious in two races of the 2013 Red Bull MotoGP Rookies Cup and combined his participation in that with five rides in the Italian national Moto3™ championship. Bastianini turned 16 at the end of 2013 and arrived in the World Championship in 2014 to ride with the Junior Team GO&FUN Moto3™ of Fausto Gresini on a KTM. He impressed in his rookie season as he hit the podium three times, staying with the team for 2015, but on a Honda. In 2015 he challenged for the title in the early stages of the year, taking his first victory on the world stage at home in Misano as well as five additional podiums. He remained with the Gresini team and on Honda machinery, and was second in the Championship in 2016. For 2017, Bastianini changed to Estrella Galicia 0,0 and had a more difficult year, gaining traction in the latter stages and taking a pole and three podiums. For 2018 he replaced outgoing reigning Champion Joan Mir at Leopard Racing, finishing fourth in the Championship after six podium finishes, including one victory. 2020 saw Bastianini become a World Champion as he took the Moto2™ crown. A podium finish in Qatar helped him launch his title attack, but it really took flight after back to back victories in the Andalusian and Czech GPs before a victory and podium finish in Misano helped cement his place among the leading contenders. From there, Bastianini only once failed to break into the Top 6 places, including podiums in the Aragon double, and it was that consistency that saw him become a World Champion. 2021 brought a new challenge, and one he thrived in. Bastianini, despite being one of only three men to be on older machinery, was one of the breakout stars of the season, with a double podium in Misano just reward for his brilliant late-season form. The Beast jumped on Pecco Bagnaia's 2021 Ducati in 2022 and moved across to the Gresini Racing team. He was without doubt the surprise package of 2022, claiming a quite remarkable four victories to help him clinch third in the standings. It all started in Qatar, then backed up in Austin and Le Mans, before he beat out Bagnaia in a sensational last lap showdown in Aragon. His performances earned him a dream move to the factory Ducati squad for 2023, but after a shoulder blade injury was picked up in Portimao's season opener, Bastianini's season would never really get going. The #23 was injured again in Barcelona but in Malaysia, The Beast returned to the top step following a stunning ride. In 2024, Bastianini will be hoping more wins and a title challenge arrives as he stays with Ducati Lenovo Team alongside World Champion Bagnaia.",
            "worldChampionship": "1",
            "victories": "11",
            "podiums": "41",
            "poles": "10",
            "races": "171"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/11/28/8d3f29d4-f987-45f4-b70e-c87e41016c8c/05_Johann_Zarco_DS_5294.png?height=400&width=600",
            "name": "Johan Zarco", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/france_a1yalx.png",
            "nationality": "France",
            "bike": "Honda" ,
            "dateOfBirth": "16/07/1990",
            "placeOfBirth": "Cannes",
            "height": "171 cm",
            "story": "Former Red Bull Rookies Cup winner Johann Zarco made the jump into the 125cc World Championship in 2009, becoming runner-up to the title in 2011 with Aki Ajo’s team before transitioning to Moto2™. Over the next three years, he achieved six podiums in the intermediate class before moving back to partner Ajo in his Moto2™ team, winning the Championship in 2015 and becoming the first man to successfully defend the Moto2™ crown since its introduction in 2010 when he took the honours again in 2016. The first Frenchman to win more than one World Championship, Zarco moved into MotoGP™ for 2017 and made an impressive debut with three podiums and two pole positions in his rookie year. He stayed with Monster Yamaha Tech 3 in 2018 and took more podiums, ending the season as top Independent Team rider. In 2019 he made the move to Red Bull KTM Factory Racing to become part of the Austrian factory's assault on the premier class. However, after an incredibly difficult opening half the season, Zarco decided to walk away from the orange brand less than halfway through his two-year deal. Then a free agent, he stepped in for Takaaki Nakagami at LCR Honda Idemitsu for the final three rounds of the season, before a move to Reale Avinita Racing opened up. He represented Ducati and Esponsorama Racing with aplomb in 2020, securing a podium finish in the Czech GP, and was promoted to the Pramac Racing team for 2021. The Frenchman had a season of two halves with Pramac, starting in magnificent fashion. Back-to-back podiums in Qatar saw him lead the premier class standings for the first time, with further podiums at Le Mans and Catalunya. But arm pump woes in the second half of 2021 saw his title charge tail away, eventually finishing fifth in the standings. He remained with Pramac for 2022 but that elusive first victory still evaded him. Four rostrums and two poles last season means he was the rider with the most poles and the rider with the most podiums to never have taken a premier class win. That statistic finally changed in 2023 though. At Phillip Island, the back flip returned as Zarco won a phenomenal Australian GP to become a MotoGP™ winner. Now, a new challenge awaits in 2024 as the Frenchman moves to CASTROL Honda LCR.",
            "worldChampionship": "2",
            "victories": "17",
            "podiums": "62",
            "poles": "27",
            "races": "261"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/e7f84e85-e76a-41fb-a412-db78a039fbea/niODwVfs.png?height=400&width=600",
            "name": "Maverick Viñales", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Aprilia",
            "dateOfBirth": "12/01/1995",
            "placeOfBirth": "Figueres",
            "height": "171 cm",
            "story": "2013 Moto3™ World Champion Maverick Viñales took the lightweight title in the CEV in 2010, as well as the European 125 Championship the following year, and debuted in the 125 World Championship in 2011. He won four races in his rookie year – third in the Championship and Rookie of the Year – and then took that title in 2013. As a Moto2™ rookie in 2014, Viñales was again Rookie of the Year and won four races – moving up to MotoGP™ the year after with Team Suzuki Ecstar. Another Rookie of the Year trophy followed, before the Spaniard then took Suzuki’s first race win since 2007 – and his maiden MotoGP™ win – at the British GP in 2016. For 2017, Viñales moved to Movistar Yamaha MotoGP to partner none other than Italian legend Valentino Rossi. After dominating pre-season testing, the Yamaha rider won the first two races of the year and the French GP, but the Movistar Yamaha team’s struggles with low grip then saw a more difficult latter half of the season. Viñales came third overall, and the struggles continued into 2018. It was the Spaniard who brought Yamaha's longest losing streak to an end, however, as he won in Australia. 2019 started slowly for Viñales, picking up just the solitary podium in the first seven races. However, victory at Assen then put the wheels in motion for a fantastic latter half of the season. Five podiums, including a win in Malaysia, saw Viñales claim P3 in the Championship. 2020 brought hopes of a title attack for Viñales, and he was in contention from the very beginning thanks to successive second places in the Jerez double, while victory at the Emilia Romagna GP bolstered his hopes. However, inconsistent form and an inability to follow up on promising Qualifying sessions saw the Spaniard slip out of the title race and finish 6th in the Championship. 2021, his fifth year at Yamaha, started in remarkable fashion with victory at the opening round. But the relationship deteriorated from there in unprecedented circumstances. 24 hours on from a podium in Assen, it was announced he'd leave Yamaha at the end of the season, one year earlier than planned, but he didn't even make it to Valencia. After over-revving his engine in Austria, Yamaha sacked the Spaniard with immediate effect. Rumours began to grow that he'd sign for Aprilia and, before long, that deal was announced and he was testing the RS-GP in Misano. The Noale factory handed him the final five rounds of the year to adapt to the new machine and prepare for a hugely important 2022 campaign. A challenging first half to the season had many questioning if the Aprilia switch would be a success before three podiums in the space of four rounds - Assen, Silverstone and Misano - changed the narrative entirely. With a new two-year deal in his back pocket, Top Gun had his sights set on a first Aprilia win in 2023. That didn't come, but Viñales claimed three Sunday P2s and two Sprint podiums on his way to P7 in the overall standings. Can that first win and a title push come in 2024?.",
            "merchandising":"https://store.motogp.com/content/ws/all/e2bc9fba-dd51-4cbc-b466-7a8805efc34c__267X370.png",
            "worldChampionship": "1",
            "victories": "25",
            "podiums": "74",
            "poles": "25",
            "races": "228"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/11/28/a884e4f7-4805-4b57-b039-5c66e94edf78/10_Luca_Marini_DS_5278.png?height=400&width=600",
            "name": "Luca Marini", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "bike": "Ducati" ,
            "dateOfBirth": "10/08/1997",
            "placeOfBirth": "Urbino",
            "height": "184 cm",
            "story": "Luca Marini, half brother of Valentino Rossi, cut his teeth racing in the Italian CIV series, ending the 2013 CIV Moto3™ championship in fourth with six podium finishes. He moved to the Spanish CEV Moto3™ series in 2014, before in 2015 he moved to the Moto2™ European Championship with the Paginas Amarillas HP 40 Junior team, taking second in just his third race. A run of aggressive rides saw him finish the year in fifth overall, and he was a regular top five contender. 2016 saw the Italian make his full time World Championship debut with the Forward Racing team alongside fellow Italian and VR46 Academy rider Lorenzo Baldassarri, where he remained for 2017. A move to Sky Racing Team VR46 for the 2018 season saw Marini string together his best year yet - claiming five podium finishes, including a maiden Grand Prix win in Sepang. Starting the season as a title favourite, Marini’s winter shoulder surgery would mean he had a difficult opening to the year. However, P2 at Mugello kick-started the Italian’s campaign, with two victories coming his way in Thailand and Japan. Marini was once again among the favourites for the Moto2™ crown in 2020 with SKY Racing Team VR46, and he lived up to the tag as he lead the chasing pack for much of the Championship. However, a nasty crash in the French GP Qualifying took its toll on the Italian as he finished P17, losing his title lead in the process. Despite battling through the injury and securing P2 in Portimao, Marini couldn’t reach the summit again and finished second in the Championship. As one of the most promising youngsters in the sport, he made the jump up to the premier class and partnered the man who edged him to the title, Enea Bastianini, at Esponsorama Racing in 2021. The young Italian found it tough at first, his big frame not suited to modern MotoGP™, but he cracked it late in 2021. A front-row start at home in Misano and a top five finish in Austria gave him a boost heading into 2022 with the new Mooney VR46 Racing squad. The Italian showed good consistency by finishing inside the top six on seven seperate occassions but, despite crossing the line fourth two times, a debut premier class podium still eluded him. It didn't elude Marini for long though. The 2023 Americas GP saw the Italian stand on the Sunday rostrum for the first time, and he'd go on to bag four Sprint podiums and another Sunday podium in Qatar, before it was announced he would be replacing Marc Marquez at Repsol Honda for 2024.",
            "worldChampionship": "0",
            "victories": "6",
            "podiums": "17",
            "poles": "7",
            "races": "144"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/07/11/1cfe9a0b-45ce-4f56-a732-2ee9edad957e/Fabioquartararo-1-.png?height=400&width=600",
            "name": "Fabio Quartararo", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/france_a1yalx.png",
            "nationality": "France",
            "bike": "Yamaha" ,
            "dateOfBirth": "20/04/1999",
            "placeOfBirth": "Nice",
            "height": "177 cm",
            "story": "Frenchman Fabio Quartararo got his start in motorcycle racing at the age of four, moving to Spain to develop his career and proclaimed national champion in the 70, 80 and 125 categories. In 2013 he won the FIM CEV Repsol Moto3™ championship and went on to win the same title again in 2014. The previous rule against participating in the Moto3™ World Championship until the age of 16 had been repealed for the winner of the then-national crown, so for 2015 - aged just 15 - Quartararo joined teammate Jorge Navarro in the Estrella Galicia 0,0 Honda team. Impressing from the start, Quartararo was on the podium in just his second race. He repeated that in Assen after claiming pole at both Jerez and Le Mans, but unfortunately a late season ankle injury halted his progress. For 2016 he moved to the Leopard Racing team with KTM machinery, and then moved up to Moto2™ in 2017 with Paginas Amarillas HP40. After some impressive showings of pace, Quartararo moved to Speed Up for his sophomore season in the intermediate class and took his first win - and pole - at the Circuit de Barcelona-Catalunya. His move to the premier class surprised many, but what followed in 2019 was nothing short of remarkable: seven podiums, fifth in the Championship and Rookie of the Year with 192 points. His stock continued to rise in 2020, opening up the season with back-to-back victories while securing a third in Barcelona. He lead the chasing pack in the Championship race until a sudden drop off in form cost him dearly and he slipped all the way down to eighth in the standings. The pressure was on straight away for El Diablo in 2021, replacing his hero Valentino Rossi in the factory Yamaha squad, but he didn't disappoint. Victory at Round 2 in Qatar was the springboard he needed and, despite arm pump issues in Jerez and problems with his leathers in Barcelona, he was a reformed character, keeping his cool to put together a memorable season. Four further victories, ten podiums, five pole positions all equalled his, and France's, first MotoGP™ World Championship. His quest to go back-to-back started well, with victories at Portimao, Catalunya and the Sachsenring seeing him lead the title chase heading into the summer break. But a largely unimproved Yamaha M1 eventually caught up with the Frenchman in the second half of the year. Quartararo's collpase coincided with Bagnaia's superlative form as the Italian was able to complete a 91 point turnaround at the final round of the year in Valencia to deny Quartararo his dream of becoming a two-time World Champion.",
            "merchandising": "https://store.motogp.com/content/ws/all/d4b379ed-17ba-4052-bce4-12738f7fff63__267X370.png",
            "worldChampionship": "1",
            "victories": "12",
            "podiums": "35",
            "poles": "19",
            "races": "158"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/11/28/e887317a-d0d7-4626-a27e-b63059c416e0/21_Franco_Morbidelli_DS_5306.png?height=400&width=600",
            "name": "Franco Morbidelli", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "bike": "Yamaha" ,
            "dateOfBirth": "04/12/1994",
            "placeOfBirth": "Rome",
            "height": "176 cm",
            "story": "Born in Rome and now living in the motorsport-rich Tavullia, Franco Morbidelli took the Superstock 600 title in 2013 alongside World Championship wildcard outings in Moto2™ at Misano, Motegi and Valencia. He went on to sign with Italtrans Racing Team for a full campaign in 2014 and continued with them in 2015, making his podium debut in Indianapolis. Unfortunately a broken leg sustained during a motocross training session saw him miss several races after Brno, with Morbidelli returning to finish the season but far from fully fit. For 2016 he signed with the highly successful Estrella Galicia 0,0 Marc VDS team and took an incredible run of podium finishes, ending the year just outside the top three in the title fight after an impressive campaign. For 2017, Morbidelli stayed with EG0,0 Marc VDS and came out swinging to take the first three wins of the year - in the lead in the standings during the entire season and taking the title at the Malaysian GP...from STK600 to World Champion in four years. He moved into the premier class within the same EG 0,0 Marc VDS team in 2018 and took the Rookie of the Year honours. 2019 saw Morbidelli join Petronas Yamaha SRT, picking up a solid seven top six finishes. It got even better for the Italian as a masterclass in Misano saw him take a maiden MotoGP™ win, and he added two more in the Teruel and Valencia GPs for a joint best three race wins in 2020, with two more podium finishes seeing him leap to second in the Championship standings. That form saw him among the leading contenders for title glory in 2021, but a knee injury hampered his season. Returning to action at Misano, Morbidelli partnered Fabio Quartararo at Monster Energy Yamaha MotoGP after gaining promotion from Petronas Yamaha SRT. The Italian signed a deal to remain a factory Yamaha rider until at least the end of 2023, but after more struggles, Morbidelli and Yamaha parted ways at the end of the campaign. In 2024, an exciting switch to Prima Pramac Racing awaits Morbidelli as he aims to return to fighting at the front again in MotoGP™.",
            "worldChampionship": "1",
            "victories": "11",
            "podiums": "27",
            "poles": "8",
            "races": "173"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/9ac9954e-0a65-4b37-bc3d-18c7a619a363/p6MYq6ml.png?height=400&width=600",
            "name": "Raúl Fernández",
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Aprilia" ,
            "dateOfBirth": "23/10/2000",
            "placeOfBirth": "Madrid",
            "height": "179 cm",
            "story": "From Madrid, Raul Fernandez began racing when he was 11 and went from the Cuna de Campeones to PreMoto3, then moved into the FIM CEV Repsol and raced in the Red Bull MotoGP Rookies Cup. By 2016 he was third overall in the Rookies with two wins and six podiums, took a win in the Moto3™ Junior World Championship and made his Grand Prix debut with a P11 finish. 2017 was a more difficult year in the FIM CEV Repsol despite Fernandez taking pole position in Portugal, but in 2018 the Spaniard bounced back in style to accrue three wins and six podiums on the way to winning the FIM CEV Repsol Moto3™ Junior World Championship. He also made four more Grand Prix appearances as a mixture of wildcards and replacement rides; Catalunya, Germany, Aragon and Valencia saw him take two top tens and score points in three of the four Grands Prix he contested. In 2019, Fernandez moved into the Moto3™ World Championship full time in the same Angel Nieto Team structure with whom he won the CEV title, and proved a quick learner as he was a regular Top 10 finisher. 2020 proved to be his breakout year, with stunning Qualifying times meaning he was a regular sight on pole position. A first podium in Aragon was followed up by a maiden victory in the European GP, while he earned another podium and victory in the season-ending Valencia and Portimao GPs respectively. Fernandez well and truly declared himself as the hottest prospect in MotoGP™ in 2021 as he enjoyed the most successful rookie campaign in Moto2™ history. An incredible eight victories, bettering Marc Marquez's previous record for rookie wins, saw him play his part in a stunning title duel against teammate Remy Gardner. However, a crash with three rounds to go in Misano all but ended his charge, eventually having to settle for runner-up. Fernandez made his MotoGP™ debut in 2022 with Tech3 KTM Factory Racing. A not-so rider friendly KTM RC16 made life tough for the talented Spaniard, finishing inside the points six times. A move to RNF Aprilia came his way in 2023 and despite some continued struggles, the second half of the season brought marked improvements. A best premier class finish of P5 in Valencia was a great way for Fernandez to head into an important 2024 campaign, as a second season with Aprilia awaits.",
            "worldChampionship": "0",
            "victories": "10",
            "podiums": "16",
            "poles": "13",
            "races": "97"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/68287e0b-22cf-49da-9878-cba02c047d35/EN5xpOkx.png?height=400&width=600",
            "name": "Takaaki Nakagami", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832208/japan_dcqxpp.png",
            "nationality": "Japan",
            "bike": "Honda" ,
            "dateOfBirth": "09/02/1992",
            "placeOfBirth": "Chiba",
            "height": "175 cm",
            "story": "From Madrid, Raul Fernandez began racing when he was 11 and went from the Cuna de Campeones to PreMoto3, then moved into the FIM CEV Repsol and raced in the Red Bull MotoGP Rookies Cup. By 2016 he was third overall in the Rookies with two wins and six podiums, took a win in the Moto3™ Junior World Championship and made his Grand Prix debut with a P11 finish. 2017 was a more difficult year in the FIM CEV Repsol despite Fernandez taking pole position in Portugal, but in 2018 the Spaniard bounced back in style to accrue three wins and six podiums on the way to winning the FIM CEV Repsol Moto3™ Junior World Championship. He also made four more Grand Prix appearances as a mixture of wildcards and replacement rides; Catalunya, Germany, Aragon and Valencia saw him take two top tens and score points in three of the four Grands Prix he contested. In 2019, Fernandez moved into the Moto3™ World Championship full time in the same Angel Nieto Team structure with whom he won the CEV title, and proved a quick learner as he was a regular Top 10 finisher. 2020 proved to be his breakout year, with stunning Qualifying times meaning he was a regular sight on pole position. A first podium in Aragon was followed up by a maiden victory in the European GP, while he earned another podium and victory in the season-ending Valencia and Portimao GPs respectively. Fernandez well and truly declared himself as the hottest prospect in MotoGP™ in 2021 as he enjoyed the most successful rookie campaign in Moto2™ history. An incredible eight victories, bettering Marc Marquez's previous record for rookie wins, saw him play his part in a stunning title duel against teammate Remy Gardner. However, a crash with three rounds to go in Misano all but ended his charge, eventually having to settle for runner-up. Fernandez made his MotoGP™ debut in 2022 with Tech3 KTM Factory Racing. A not-so rider friendly KTM RC16 made life tough for the talented Spaniard, finishing inside the points six times. A move to RNF Aprilia came his way in 2023 and despite some continued struggles, the second half of the season brought marked improvements. A best premier class finish of P5 in Valencia was a great way for Fernandez to head into an important 2024 campaign, as a second season with Aprilia awaits.",
            "worldChampionship": "0",
            "victories": "2",
            "podiums": "14",
            "poles": "6",
            "races": "242"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/11/28/61234ddf-029a-4473-b288-52e7901afd3b/31_Pedro_Acosta_DS_5257.png?height=400&width=600",
            "name": "Pedro Acosta", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "KTM" ,
            "dateOfBirth": "25/05/2004",
            "placeOfBirth": "Mazarrón",
            "height": "171 cm",
            "story": "Murcian rider Pedro Acosta, in 2017, was crowned PreMoto3™ Champion of Spain with two races to spare, making the jump to the Moto3™ Junior World Championship the following year. In a category that he competed in since 2019 alongside the Red Bull MotoGP Rookies Cup, he was a stand out rider in both competitions. In the FIM CEV Championship, he recorded podium finishes, while in the Rookies Cup he took runner-up, achieving three victories and five podiums, and second only to Carlos Tatay. 2020 saw him go one further and claim the Rookies Cup title before graduating onto the Moto3™ World Championship stage with Red Bull KTM Ajo. His impact in the class was instant, taking P2 in the season opener before going on to claim three consecutive victories, the best of which was a stunning ride from pitlane to P1 at the Doha GP. Suddenly he was the name on everyone’s lips and rumours of a direct move to MotoGP™ began to circulate. Three more victories and another podium saw the rookie seal the lightweight class crown but a move to the premier class never materialised, with Acosta instead opting for a seat in Moto2™. In his debut season in the class, Acosta made more history by becoming the youngest ever race winner with victory at Mugello. Two more wins and two more podiums helped him to fifth in the Championship and the Moto2™ Rookie of the Year title. He remained within the ranks of Aki Ajo’s KTM outfit and following seven wins, Acosta won his second title in three years with two races to spare. One of the most exciting talents we've ever seen now gets set for MotoGP™ with GASGAS Factory Racing Tech3 in 2024. What can the #31 achieve in his rookie season?",
            "worldChampionship": "2",
            "victories": "16",
            "podiums": "27",
            "poles": "5",
            "races": "56"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/8ec0425d-a31c-44fb-9da3-fed5663b1ad1/WBIOoIRV.png?height=400&width=600",
            "name": "Brad Binder", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832208/south_africa_lvtuuk.png",
            "nationality": "South Africa",
            "bike": "KTM" ,
            "dateOfBirth": "11/08/1995",
            "placeOfBirth": "Potchefstroom",
            "height": "170 cm",
            "story": "South African Brad Binder is a former Red Bull MotoGP Rookie and his star moment in the Cup came in Estoril in 2011 when he won the race from pole to flag by a margin of 15 seconds. That year he also rode his first 125 GP, before competing in the Moto3™ World Championship full-time for the first time in 2012. His first podiums came in 2014, before a move to the Red Bull KTM Ajo squad for 2015 saw him add four more podiums. For 2016 he and the Ajo team remained together and took the Moto3™ title in stunning style, winning it in the Aragon GP. Binder moved to Moto2™ with the Red Bull KTM Ajo team in 2017, racing the new KTM chassis in the intermediate class, but found the first half of his season marred by an arm injury. Forced to be patient as he fought back to full strength, once he was there the South African ended the season with three podiums in a row. In 2018, Binder stayed with Red Bull KTM Ajo and managed to secure his first three Moto2™ victories, finishing third in the Championship. A troubled KTM chassis meant one of the title favourites had to wait until Round 8 for a 2019 rostrum, but Binder’s latter half of the season form was sensational, missing the podium just three times in 12 races, winning five – including the last three. Binder eventually missed out on the Moto2™ title by just three points but he moved up to Red Bull KTM Factory Racing as one of the most exciting talents on the MotoGP™ grid in 2020. And he did not disappoint, taking victory at the Czech GP, becoming the first rookie since Marc Marquez to win a race. He didn’t quite scale those heights again for the rest of the season, but he did claim the Rookie of the Year award following a string of impressive performances, which saw him record four more Top 10 finishes and 11th in the Championship. Binder added MotoGP™ win number two to his resumé during 2021 and did so in breathtaking circumstances. The South African rolled the dice as the rain started to fall in Austria and fortune certainly favoured the brave as he clinched his only podium of the season. The number 33 ended sixth in the standings and matched that in 2022. Despite going winless, three podium finishes and some now signature Sunday surges through the field saw the South African's stock rise yet higher. In 2023, an improved KTM package saw Binder fighting at the front for most of the season, as five Sunday podiums and two Sprint wins saw him finish P4 in the standings. No Grand Prix win came though, so in 2024, that - and a title charge - will be the target for Binder and KTM.",
            "merchandising": "https://store.motogp.com/en/brad-binder/a-2466210634+z-909007-2827827628",
            "worldChampionship": "1",
            "victories": "17",
            "podiums": "45",
            "poles": "7",
            "races": "217"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/632b4fff-4a16-465c-864f-2493995e69f5/FU25ODeO.png?height=400&width=600",
            "name": "Joan Mir", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Honda",
            "dateOfBirth": "01/09/1997",
            "placeOfBirth": "Palma de Mallorca",
            "height": "181 cm",
            "story": "Before he became a World Champion, Joan Mir was selected for the Red Bull Rookies Cup and took a second place finish during his first year. He showed great speed during the 2014 Rookies season with three wins, two seconds and a third. Many expected him to be a title contender during the 2015 FIM CEV Repsol Moto3™ Junior World Championship, and he ended the season in fourth taking some incredible wins - and in with a fighting chance of the title until the final round of the year. He also made his Grand Prix debut that year at the Australian GP, replacing the injured Hiroko Ono, and impressed many with his pace. He moved up to the World Championship with Leopard Racing aboard a KTM in 2016 and was Rookie of the Year, taking his first victory at the Austrian GP. For 2017, Mir remained with Leopard Racing to fight for the title, but this time on a Honda - and took a stunning ten wins on the way to wrapping up the crown at Phillip Island, at the same venue where he made his debut only two years before. The Mallorcan moved up to Moto2™ with EG 0,0 Marc VDS to partner Alex Marquez in 2018 and took podiums on the way to being crowned Rookie of the Year; good preparation for a quick graduation to the premier class with Team Suzuki Ecstar. His maiden MotoGP™ year was impressive and his latter season form after a monster Brno testing crash was superb. 10 top 10s and a best finish of P5 in Australia was a sign of things to come from the Mallorcan, as 2020 became the year of Mir. It wasn’t the most auspicious of starts from the Suzuki rider, as he retired twice in the first three races of the season, but following the Czech GP, he became a model of consistency. Four podiums in the next five launched his title bid, and while all those around him were faltering, Mir kept producing the goods to take the Championship lead with podiums in the Aragon double, meaning his fate was in his own hands. Then the highlight of the year, his maiden victory came following a commanding performance in the European Grand Prix, all but securing the title with two races to go. As the grid returned for the Valencia GP the following week, Mir’s seventh place finish meant he followed in the footsteps of fellow Mallorcan Jorge Lorenzo in becoming a MotoGP™ World Champion. He was unable to defend the crown in 2021, though, with Suzuki's GSX-RR falling slightly behind the development curve throughout the season. Mir did, however, secure third in the standings thanks to six podium finishes. Mir's 2022 started with five top six finishes in the first six races but once news broke that Suzuki would leave the sport at the end of the season, the wheels fell off. Countless crashes and a serious ankle injury suffered in Austria saw his season peter out, as a fresh challenge with Repsol Honda came in 2023. Too many crashes and injuries, plus a struggling bike, plighted Mir's debut campaign with Honda, with P5 in India the best result of the season. Can HRC improve their bike to allow Mir to return to fighting for podiums and wins in 2024? Time will tell.",
            "worldChampionship": "2",
            "victories": "12",
            "podiums": "33",
            "poles": "2",
            "races": "135"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/641ffee3-54db-4cdb-b6f1-9d7de8365660/wXXlUcOg.png?height=400&width=600",
            "name": "Augusto Fernández", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "KTM",
            "dateOfBirth": "23/09/1997",
            "placeOfBirth": "Madrid",
            "height": "180 cm",
            "story": "Augusto Fernández, crowned Junior European Champion in 2014, competed in the Superstock 600, where he achieved a victory in the 2015 season. Fifth in the FIM CEV Repsol Moto2™ the following year, the Madrid-born Balearic rider began his 2017 season with a new podium, before being summoned by Speed ​​Up to take his first steps in the Moto2™ Championship, starting at the 2017 Italian GP. Despite the 6 points scored, he did not find a motorcycle for 2018 and therefore returned to the FIM CEV Repsol Moto2™. However, the Pons HP 40 turned to him, during the Catalan GP, ​​to replace Héctor Barberá. The Spaniard finished inside the top 8 three times, and even came close to the podium at the Japanese GP. The 2019 campaign was his big turning point, despite an initial injury that cost him in Argentina and Austin, a first podium at Jerez was followed by another at Le Mans, with a first victory at Assen. Two more victories followed as a title challenge loomed, but no podiums in the past six races left him out of the fight. For 2020 he started as one of the favourites in the title fight after filling the vacancy left by Álex Márquez at EG 0,0 Marc VDS. However, his performance was not as expected and he was 13th overall. No victories came in 2021 either but we did see him return to form in the latter half of the season, taking six podiums in the final nine races. That form was enough for him to earn a seat for 2022 at Red Bull KTM Ajo, whose faith he rewarded with a campaign which yielded four race wins and saw him crowned World Champion after finishing second to teammate Pedro Acosta in the finale at Valencia. Fernandez's debut premier class season was a success, with P4 at the French GP the highlight. Continuing with GASGAS Factory Racing Tech3 in 2024, Fernandez will aim to claim a first podium - at least - in his sophomore season.",
            "worldChampionship": "1",
            "victories": "7",
            "podiums": "20",
            "poles": "3",
            "races": "114"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/d61e2c05-c564-479f-8578-d1e6a30f9b35/ucV0oYYh.png?height=400&width=600",
            "name": "Aleix Espargaró", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Aprilia" ,
            "dateOfBirth": "30/07/1989",
            "placeOfBirth": "Granollers",
            "height": "180 cm",
            "story": "Aleix Espargaro was the youngest ever rider to win the 125cc Spanish National Championship when he claimed the title in 2004, before moving onto the world stage the year after. After taking his first World Championship podium in Moto2™ in 2011, 2012 saw Espargaro graduate to MotoGP™ and claim the title of Champion in the CRT category before repeating the feat in 2013. Top “Open” rider the year after, and on the podium at MotorLand Aragon, Espargaro then joined the factory Suzuki team in 2015, hauling more points and a pole position at the Catalan GP. In 2017, Espargaro moved to Aprilia Racing Team Gresini and took some top results for the Noale factory, including a best of sixth in both Qatar and Aragon. Progressively cutting the gap to the front, Espargaro remained with Aprilia in 2018 but it was off to a tough start before they made some big progress in the latter half of the year. Remaining with the team in 2019, Espargaro earned a best result of P7 on an unfavoured RS-GP, a result he couldn’t quite match during 2020, as despite being a consistent Top 10 challenger, he finished 17th overall in the Championship. He continued for a fifth season with Aprilia in 2021 and his hard work was rewarded with a much-improved RS-GP. He later became the Noale squad's history-maker by taking their debut MotoGP™ podium in Silverstone. 2022 would turn into a year he'll never forget, as Espargaro fought for the World Championship for the first time in his career. A career-first Grand Prix victory in Argentina kickstarted a season that included five further podium visits. A disappointing final five rounds saw the Spaniard slip out of title contention and the Championship top three, and in 2023, another title push never materialised. Still, two more wins came at Silverstone and on home turf in Barcelona, but a more consistent season is needed for Espargaro and Aprilia in 2024.",
            "worldChampionship": "0",
            "victories": "3",
            "podiums": "12",
            "poles": "5",
            "races": "321 (y solo ha ganado 3 carreras en su vida Hulio)"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/11/28/6640c07d-2742-4668-b60a-7c63b0d2b18a/42_Alex_Rins_DS_6238.png?height=400&width=600",
            "name": "Alex Rins", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Honda" ,
            "dateOfBirth": "08/12/1995",
            "placeOfBirth": "Barcelona",
            "height": "176 cm",
            "story": "Alex Rins won the CEV in 2011 before moving up to the Moto3™ World Championship in 2012 and gaining the title of Rookie of the Year. A title contender down to the last corner in 2013 after more wins and podiums, the Spaniard was just beaten to the crown by compatriot Maverick Viñales. After a more difficult 2014 affected slightly by injury, Rins moved to Moto2™ for 2015 and was Rookie of the Year, taking wins in his debut season in the intermediate class. A title challenger in 2016, the former national Champion finished the season in third after more impressive wins and podiums, and moved up to MotoGP™ in 2017 with Team Suzuki Ecstar. Despite some trouble with injury and missed races, Rins was impressive and took some top five results as a rookie a good springboard for his sophomore season. He went on to take five podiums in 2018 and consistently fight at the front; another solid foundation for 2019. The next step was made in 2019 as Rins claimed a maiden MotoGP™ victory at the Americas GP, before repeating the feat in Silverstone. 2020 was another outstanding year for the Spaniard as he claimed victory in the Aragon GP as well as podium finishes in the Catalan, Teruel and European GPs, helping him claim 3rd overall in the Championship. 2021 was a year to forget for Rins, with crashes at crucial times costing him dearly. He threw away opportunities on no fewer than six occasions, tasting podium success once at the British GP. The Spaniard bounced back in 2022, delivering some superb performances despite real adversity. Top of the Championship after five rounds, Suzuki's exit hit the team hard resulting in a dip in form. But magnificent wins at Phillip Island and Valencia saw Rins finish the season as the form man, giving him great confidence heading into 2023 with the LCR Honda outfit. A famous victory was bagged at the Americas GP, but Rins' season came to a painful halt after he suffered a nasty leg break at the Italian GP. Missing 13 races in total, Rins will be hoping 2024 brings better fortunes as he gets set for a new challenge with Monster Energy Yamaha alongside Quartararo.",
            "worldChampionship": "0",
            "victories": "18",
            "podiums": "58",
            "poles": "17",
            "races": "194"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/bb3690ac-1250-4486-a60b-e07b6c54a321/22xRcZYS.png?height=400&width=600",
            "name": "Jack Miller", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/australia_xfvhb2.png",
            "nationality": "Australia",
            "bike": "KTM" ,
            "dateOfBirth": "18/01/1995",
            "placeOfBirth": "Townsville",
            "height": "173 cm",
            "story": "Jack Miller made his road race debut in 2009 after beginning his career on dirt and debuted in the 125 World Championship soon after. Taking the 125 IDM crown on his way to full time competition on the world stage, Miller first impressed in 2013 when he proved a consistent frontrunner with Racing Team Germany. A title challenge with Red Bull KTM Ajo in 2014 saw Miller just miss out to Alex Marquez, before he made the incredible move from Moto3™ straight to MotoGP™ in 2015. After a tough rookie season, Miller took a stunning maiden win in 2016 at the TT Circuit Assen, despite a season that began with a broken leg and was then subsequently interrupted by more injury. Taking a good number of top ten results, Miller remained with the Estrella Galicia 0,0 Marc VDS team for 2017 and impressed once more before moving to Pramac for 2018 and switching from Honda to Ducati machinery. More consistent and taking his first pole position, it was a solid season for the Australian who remained with Pramac Racing in 2019 and on GP19, Miller was super impressive. Five podiums came the number 43’s way in and he continued to show his class throughout 2020, earning another four podium finishes, though that first win in Ducati colours still escaped him. A move to the factory squad was deserved and he delivered in 2021: two victories, three further podiums and fourth in the World Championship. Miller again proved his quality in 2022 with seven podiums, including the best MotoGP™ performance of his career when he won with ease in Japan. After five years in red, Miller donned the orange of KTM - and the season started strong with a double podium at the Spanish GP. Another Sprint podium was claimed at the German GP but after a lowkey second half of the season, Miller will be hoping regular rostrum charges come in his second season with KTM in 2024.",
            "worldChampionship": "0",
            "victories": "10",
            "podiums": "33",
            "poles": "10",
            "races": "212"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/11/28/1236aef6-609d-4689-8f6f-642ddd107963/49_Fabio_Di_Giannantonio_DS_5323.png?height=400&width=600",
            "name": "Fabio Di Giannantonio",
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png", 
            "nationality": "Italy",
            "bike": "Ducati" ,
            "dateOfBirth": "10/10/1998",
            "placeOfBirth": "Roma",
            "height": "175 cm",
            "story": "Fabio Di Giannantonio hails from Rome, Italy and ended the 2013 European Moto3™ Championship in ninth. For 2014 he began to focus on the Red Bull Rookies Cup, ending the year in eighth with a best finish of second at Brno. In 2015 he emerged as a title contender, taking two wins and four second place finishes to end the year in second. This saw him quickly snapped up by the Gresini team, racing the final 2015 round for them in Valencia before joining the team full time in 2016. After fighting to be Rookie of the Year and taking three podiums, Di Giannantonio stayed with Del Conca Gresini Racing Team Moto3™ for 2017 and took five podiums to take P5 overall. He remained with the outfit in 2018, and managed to secure second in the lightweight class Championship after claiming his first two Grand Prix race wins. A step up to the Moto2™ class with Speed Up Racing was the Italian’s next chapter, and it was an impressive year. Six top tens, coupled with two podiums in Brno and Misano, saw Di Giannantonio claim P9 overall and the Moto2™ Rookie of the Year. Chasing a first intermediate class victory in 2020, the Italian could only muster two podium finishes while he cruelly crashed out in the Valencia GP as he searched for that elusive victory. 2021 was a year of change as Di Giannantonio moved to Federal Oil Gresini Moto2 and a Kalex bike. Better fortunes came his way as he clinched that all-important Grand Prix win in Jerez. Three other podiums were enough to earn the Italian a dream move to MotoGP™ in 2022. The highlight of Diggia's rookie campaign was pole position at his home Grand Prix at Mugello, and he remained with Gresini Racing in 2023, but teamed up with World Championship winning crew chief Frankie Carchedi. Pre-summer brought a best finish of P8, but the Italian raised his game in the final races of the season. A debut podium came in Australia before a first MotoGP™ win was pocketed in Qatar. A late penalty denied Di Giannantonio a podium in Valencia too, but it was his incredible late-season form that saw him bag a ride alongside Bezzecchi in the VR46 set-up, having lost his Gresini seat to Marc Marquez. Now, can this form continue in 2024?",
            "worldChampionship": "0",
            "victories": "4",
            "podiums": "24",
            "poles": "2",
            "races": "147"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/9e9cc8f6-8ddb-4c4c-a6d8-712851fb3dce/L7mD2P5e.png?height=400&width=600",
            "name": "Marco Bezzechi", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "bike": "Ducati" ,
            "dateOfBirth": "12/11/1998",
            "placeOfBirth": "Rimini",
            "height": "174 cm",
            "story": "Bursting onto the Italian scene as runner-up in the CIV Moto3™ title in 2014, Italian Marco Bezzechi then went one better in his second year in the series as he took the title with an incredible seven wins. After two appearances in Moto3™ on the world stage with San Carlo Team Italia in 2015, Bezzechi also did two further races in 2016 with Mahindra Racing, as well as showing good promise in the FIM CEV Repsol and winning in both his appearances back in the CIV in Italy. For 2017, Bezzechi moved up to Moto3™ full time to partner compatriot and former CIV rival Manuel Pagliani at CIP. Fighting for Rookie of the Year, the Italian just missed out but took a first podium finish, and moved to Redox PruestelGP for 2018. Nine podiums in 2018, including three victories, saw Bezzecchi mount a lightweight class title assault against eventual Champion Jorge Martin. Despite missing out on the title, a hugely impressive Moto3™ campaign means Bezzecchi secured a Moto2™ seat with Red Bull KTM Tech3 in the Moto2™ class for 2019. A pair of Top 10s in Assen and Thailand were his best results with the French team before switching to SKY Racing Team VR46's Kalex heading into 2020. There, he earned seven podium finishes, including two victories in Styria and Valencia. His consistency allowed him to keep fighting for the title, but two falls in the last 5 races relegated him to fourth place. In 2021, the Italian made seven visits to the podium, including victory at the Red Bull Ring, to secure third in the Championship and earn himself a promotion to MotoGP™ with the Mooney VR46 squad. Bezzecchi was instantly impressive, comfortably clinching the Rookie of the Year title. His standout moment came at the Dutch TT, where he bagged a career-first MotoGP™ podium. In 2024, Bezzecchi started the year incredibly, winning two of the first five races. The Italian strung together a fantastic season and won for a third time in India, but a broken collarbone caused by a training crash ultimately cost Bezzecchi a chance at really challenging Bagnaia and Martin for the title. After turning down a factory Ducati with Prima Pramac Racing, the #72 heads into 2024 on a title-winning GP23 knowing he has what it takes to fight for the crown.",
            "worldChampionship": "0",
            "victories": "9",
            "podiums": "32",
            "poles": "8",
            "races": "132"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/10587c93-5959-40a9-a73f-c157f2423b2d/qhUTaqai.png?height=400&width=600",
            "name": "Alex Marquez", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Ducati" ,
            "dateOfBirth": "23/04/1996",
            "placeOfBirth": "Cervera",
            "height": "180 cm",
            "story": "The younger brother of reigning MotoGP™ World Champion Marc Marquez, Alex Marquez began his path to the world stage in 2010 when he joined Team Competition Monlau 125 in the FIM CEV Repsol. He did not participate in the first race of the Championship, as he was five days below the minimum age to compete. Yet in the second race, held at Albacete, he achieved 11th place. That year he finished 11th in the final standings with 24 points. In 2011 he then came very close finishing the season top, but just missed out to older rival Alex Rins. 2012 proved to be his year, as he won the Moto3™ CEV title, and took part in numerous wildcard rides in the Moto3™ World Championship including an incredible performance at the Catalan GP. For the 2013 season he stepped up full time with the Estrella Galicia 0,0 team and secured his first victory at Motegi, coming fourth overall. In 2014, Marquez won more races and took more podiums on the way to taking the Moto3™ World Championship. Marquez then moved up to Moto2™ with the EG0,0 Marc VDS team for 2015 and had a tough rookie year with two top four finishes, looking to expand on the potential he showed the following year as rider and team remained together in 2016. He started the season with an arm injury, but then took his first podium finish with a stunning ride at MotorLand Aragon to come home P2 after a last corner duel. Taking his first intermediate class win after proving unstoppable on home turf at Jerez, Marquez followed it up with another win at home in the Catalan GP. Then injured mid-season and taking some time to recover fully, the rider from Cervera was unable to fight for the title but took fourth overall, after another victory at Motegi in a tactical masterpiece. In 2018, Marquez was able to claim six podium finishes, but he went the year without a win. Remaining with the team for another year, 2019 saw Marquez step up to the plate. Five victories and another five podiums saw him claim his second World Championship with a race to spare, and following Jorge Lorenzo’s retirement from MotoGP™, the then Moto2™ World Champion stepped into the Repsol Honda colours to partner his brother Marc for 2020. While it was a year to forget for the older Marquez brother, Alex made hay as he claimed back-to-back second places in the French and Aragon GPs. He narrowly missed out on the Rookie of the Year award, coming 14th overall in his maiden year. 2021 saw him remain with Honda, but in the LCR Honda Castrol ranks under the guidance of Lucio Cecchinello. A struggling Honda package saw Marquez struggle to find any real form, but P4 at the Algarve GP was a reminder of the speed Marquez possesses. Staying with LCR in 2022, a brand-new HRC bike couldn't deliver an upturn in results as Marquez failed to break into the top six all year. 2023 saw the Spaniard jump on Bagnaia's Championship-winning GP22 as he replaced Bastianini at Gresini Racing. Two Sunday podiums arrived, the best of which came in Malaysia with a P2, while a Sprint win was claimed at Silverstone. A second season with Gresini Ducati awaits in 2024, with wins the obvious objective. Marquez also welcomes his older brother Marc to the team too, a fantastic challenge for the #73.",
            "worldChampionship": "2",
            "victories": "12",
            "podiums": "42",
            "poles": "16",
            "races": "204"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/51bae0bb-59b4-4cd6-954a-12420af4afce/OkorDEXf.png?height=400&width=600",
            "name": "Miguel Oliveira", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832208/portugal_y1imti.png",
            "nationality": "Portugal",
            "bike": "Aprilia" ,
            "dateOfBirth": "04/01/1995",
            "placeOfBirth": "Pragal",
            "height": "170 cm",
            "story": "Miguel Oliveira’s first big successes came in 2005 and 2006 when he won the Portuguese MiniGP championship. In 2009 he was third in the FIM CEV Repsol, and in 2010 battled Maverick Viñales to the final race of the season for the title - eventually finishing runner-up by just two points prior to his World Championship debut in 2011. Oliveira raced full time in 2012 with the Estrella Galicia 0,0 team and took two podiums, before in 2013 he joined Mahindra Racing and made headlines by grabbing the Indian manufacturer’s first ever podium in Malaysia. In 2014 remained on the Mahindra, taking another podium at Assen, before being recruited by Red Bull KTM Ajo for 2015. The Moto3™ season got off to a difficult start for the Portuguese rider but he won in both Mugello and Assen, before breaking his wrist in Germany. All hope looked lost as Danny Kent left the British GP with a 110 point lead over the KTM rider, but an incredible comeback saw Oliveira take four wins and two seconds in the final six races and challenge down to the final round, coming runner up. For 2016 he and Kent joined forces in the Moto2™ World Championship with Leopard Racing, and after recovering from injury for the end of the year, the Portuguese rider returned to the Ajo motorsport camp for 2017 onboard the new KTM chassis in Moto2™, with Red Bull KTM Ajo. Taking their first win, challenging at the front and coming third overall, Oliveira’s season was a stunner – and he remained a threat at the front in 2018. Eventually taking the runner up spot in the title fight, it was nevertheless an impressive season and the Portuguese rider then made his MotoGP™ debut with Red Bull KTM Tech 3. Regular point-scoring finishes saw Oliveira impress in his maiden premier class season, P8 in Austria was his best result. A huge Phillip Island crash and surgery on an injury sustained at Silverstone saw Oliveira have to sit out the final three races and preseason testing at the end of 2019. Staying with Red Bull KTM Tech 3 for 2020, Oliveira became the second KTM rider to claim victory in the premier class, following a stunning last lap in the Styrian GP, Oliveira stole ahead on the final corner to claim the win. The MotoGP™ circus returned to his home country for the Portuguese GP, and Oliveira ensured it was a dream weekend as he clinched victory in the season finale. 2021 saw him partner Brad Binder in the factory colours, but an underperforming KTM and injury saw Oliveira have a rollercoaster season. Three podiums, including victory in Barcelona, were the highlights. KTM's RC16 failed to make the improvements they had hoped for, meaning Oliveiria struggled in dry conditions to challenge at the sharp end. But he was by far and away the rain master of 2022 as the Portuguese star romped to his fourth and fifth premier class wins in the torrential rain of Indonesia and Thailand. After six seasons in orange, Oliveira moved to the RNF Aprilia squad for 2023. An opening round injury on home soil, and another one in Jerez, ruined the first half of the season for the luckless Portuguese rider. A P5 at Silverstone was the highlight, as Oliveira's season ended with another injury that was picked up in Qatar. In 2024, the #88 hopes to stay injury free and to challenge for wins and podiums with Aprilia",
            "worldChampionship": "0",
            "victories": "17",
            "podiums": "41",
            "poles": "5",
            "races": "214"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/09/23/971a3e6e-ab64-4507-9b6b-572741c2d3c9/Yd6Ecyd1.png?height=400&width=600",
            "name": "Jorge Martín", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "bike": "Ducati" ,
            "dateOfBirth": "29/01/1998",
            "placeOfBirth": "Madrid",
            "height": "167 cm",
            "story": "Jorge Martin joined the Red Bull Rookies Cup for the 2012 season. Unfortunately it was a season plagued by various injuries, but the following year he tried again and finished runner-up behind the 2013 champion Karel Hanika. In 2014 he dominated the same Championship and took the crown. For 2015 Martín took the next step and participated in his first full season in the Moto3™ World Championship, where he joined the Mahindra Mapfre Aspar team. An awesome seventh in Aragon helped the Spaniard to finish the year 17th overall, with he and the Aspar team electing to continue their relationship for 2016. For 2017, the Spaniard moved to Del Conca Gresini Racing Moto3 to replace outgoing title contender Enea Bastianini. The master of qualifying and on pole for half the entire season, Martin took an impressive nine podiums despite a mid-season injury, and his maiden win in the season finale on the way to P4 overall. His stellar year would arrive in 2018 as Martin beat Marco Bezzecchi to the Moto3™ crown, claiming seven victories despite picking up another mid-season injury. Red Bull KTM Ajo in Moto2™ became the Spaniards home in 2019, and he rewarded his new team with podium finishes in Japan and Austria toward the tail end of the season. A title charge awaited in 2020, a Spanish GP podium followed up with a victory and podium finish in the Spielberg double, he was right in the Championship mix. However, a positive Covid-19 test meant he missed the Misano double, and successive retirements put to bed any plans of the Championship. There were three more podiums in the final five Grand Prix, including victory in Valencia, which helped him secure fifth place in the standings. 2021 brought a move up to MotoGP™ with Pramac Racing on a GP21, and it's safe to say Martin hit the ground running. A debut pole and podium were secured in Doha before a huge crash in Portimao saw him break eight bones. Missing four races, Martin returned and after the summer break, in Austria, a first victory was his. Two more podiums helped Martin secure the Rookie of the Year crown, and in 2022, the Spaniard was tipped for greatness. Martin was the pole master of 2022, smashing lap records left, right and centre to take five Saturday honours throughout the year. But failed to convert any of them into victory and was unable to build on an excellent rookie campaign. The Spaniard was a wounded animal heading into 2023 after being overlooked for the factory Ducati seat - and he bit back immediately. Martin was a standout performer on his way to four Sunday wins and nine Sprint victories, but his dream of becoming World Champion proved to be just out of reach in Valencia. Nevertheless, Martin heads into 2024 as a firm favourite to challenge for the title again.",
            "merchandising": "https://store.motogp.com/en/jorge-mart%C3%ADn/a-3599215173+z-80391-2503475791",
            "worldChampionship": "1",
            "victories": "15",
            "podiums": "44",
            "poles": "34",
            "races": "153"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/5e5d5b21-1397-457d-b8c0-d7fb49f8dd94/qAvPc6Vj.png?height=675&width=745",
            "name": "Valentino Rossi", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "dateOfBirth": "16/02/1979",
            "placeOfBirth": "Urbino",
            "story": "The only rider in history to win 125, 250, 500 and MotoGP™ World Championships, Valentino Rossi dominated MotoGP™ with first Honda and then Yamaha, taking the crown five times in a row until Nicky Hayden won the title in 2006. Back on top in 2008 and 2009, the Italian was then beaten to the crown by teammate Jorge Lorenzo in 2010 and left to join the factory Ducati Team. After three podiums over a tough two seasons, the rider from Tavullia was back at Yamaha for 2013 and took his first win in three years in Assen. Runner up in the title in 2014, Rossi then fought for his tenth crown in 2015 but was beaten in the final race by Lorenzo once again. 2016 has seen more pole positions, podiums and race wins and saw the Italian runner up once again; remaining with Movistar Yamaha MotoGP for 2017 with new teammate Maverick Viñales. Another win, at the Dutch GP at the TT Circuit Assen, was the jewel in another successful season – but struggles for the team with low grip and a broken leg sustained in training just before Misano put a damper on the latter half of the year. Rossi impressed to come back from his injury after only three weeks, however, and took another podium before the end of the year, coming second in the awesome showdown at Phillip Island. For 2018, the Italian remained with Yamaha and took another top three overall in the standings, but Rossi didn't stand on the top step in 2018. No win would come Rossi’s way in 2019 either, two podiums in the opening three races would be the only time we saw the number 46 spray the bubbly, while it didn’t get better in 2020, with third in the Andalusian GP his season best result. 2021 sees him make the move to Petronas SRT where he can link up with his academy graduate Franco Morbidelli. Will the change of scenery spark new life into the MotoGP™ veteran?",
            "merchandising":"https://vr46.com/en-eu",
            "gallery":"../images/google-icon.png",
            "worldChampionship": "9",
            "victories": "115",
            "podiums": "235",
            "poles": "65",
            "races": "432",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/64496d27-818e-44a0-996e-318f25eaacf6/LchrPceA.png?height=675&width=745",
            "name": "Alex Criville", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "dateOfBirth": "04/03/1970",
            "placeOfBirth": "Seva",
            "story": "Like most of the Spanish riders of his generation, Alex Criville began racing bikes in the 80cc category. World 125cc Champion at the age of 19, the Catalan star progressed through 250 and was a 500 rider by 1992, winning the Dutch TT at Assen in his debut season. In 1994 he was brought in to the HRC team alongside Mick Doohan to take up a position as team-mate to the decade's best rider. Five years later in 1999 he emerged from Doohan's shadow to lift the World Championship, becoming the first Spanish rider in history to claim the 500cc crown. The following season saw him concede the title to Suzuki's Kenny Roberts and eventually finish in ninth position, and in 2001 he placed one spot higher on the then all new NSR. Shortly before the start of the 2002 season Criville considered joining the Yamaha team of Luis d’Antin but eventually decided to retire permanently.",
            "worldChampionship": "2",
            "victories": "20",
            "podiums": "66",
            "poles": "12",
            "races": "194",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/9bb68665-ccb0-4488-b9bb-aeeca0d650cc/9b2z95lq.png?height=675&width=745",
            "name": "Max Biaggi", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "dateOfBirth": "26/09/1971",
            "placeOfBirth": "Roma",
            "story": "Max Biaggi fell in love with motorcycles in 1988 when a friend invited him to ride at the local Vallelunga circuit and his natural talent blossomed as he graduated swiftly through the Italian Sport Production Series, the 125 Italian Championship and the European 250 Championship, which he won in 1991. 1992 marked his arrival in 250 GP with victory in South Africa and fifth place overall. The next six seasons saw Biaggi take 33 pole positions, 29 wins and 4 World Championships. In 1998 he moved to the 500 class, finishing second behind Mick Doohan in his rookie year. After four seasons with Yamaha, Biaggi returned to Honda with Pramac Pons in 2003, finishing third that year and the next. Biaggi joined Factory Honda for his final MotoGP season in 2005.",
            "worldChampionship": "4",
            "victories": "42",
            "podiums": "111",
            "poles": "56",
            "races": "215",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/015f7f43-b27b-470c-a17b-ea8fc3a8cf8c/WBpBTEvs.png?height=675&width=745",
            "name": "Mick Doohan", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/australia_xfvhb2.png",
            "nationality": "Australia",
            "dateOfBirth": "04/06/1965",
            "placeOfBirth": "Brisbane",
            "story": "Australian MotoGP Legend Mick Doohan won five premier class titles in a period of domination that broke records and defined the sport in the 1990s. Beginning his career in superbikes Doohan quickly rose to prominence due to his outright speed, unwavering determination and eye-catching style - which saw him hang his lower body off the side of the bike. He joined the World Championship as team-mate to fellow Aussie and MotoGP Legend Wayne Gardner in 1989, at the age of 23. That maiden season was particularly memorable for his tyre-smoking rear wheel steering at the Brazilian round and some promising early results. In 1990 he took the first of his 54 premier class victories at Hungary and just two years later was already in contention for the championship. Although he crashed on relatively few occasions, there were some nasty injuries on the way. He ground his hand down to the bone on his Australian GP debut in 1989, and nearly had to have his left leg amputated after a practice crash at Assen in 1992, a year in which he was dominating until the trip to Holland. The forced absence eventually gave the title to Wayne Rainey, despite a heroic and premature comeback from Doohan. Although he was never fully fit in 1993 from 1994 onwards he blazed across the series and was not knocked off his throne until a broken leg sustained in an accident at Jerez in 1999 was the catalyst for announcing his retirement. Doohan’s career was defined by his loyalty to Honda (from whom he never departed while racing), his 12 wins from 15 in 1997 and his duels with Alex Criville (1996) and Max Biaggi (1998) en route to five consecutive premier class titles.",
            "worldChampionship": "5",
            "victories": "54",
            "podiums": "95",
            "poles": "58",
            "races": "137",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/20/0d1c636c-a004-45a1-8127-1fdfeaa6ddbb/dovi.png?height=675&width=745",
            "name": "Andrea Dovizioso", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "dateOfBirth": "23/03/1986",
            "placeOfBirth": "Forlimpopoli",
            "story": "2004 125cc World Champion Andrea Dovizioso has been in MotoGP™ since an incredible rookie season in 2008, where he was the top Independent Team rider and fifth overall. His first victory came at Donington in 2009 when riding for Repsol Honda, before the Italian moved to the Ducati Team following a stint with Monster Yamaha Tech 3. A key part of Ducati’s journey back to the top, ‘DesmoDovi’ is one of the hardest to overtake on the brakes and one of the cleanest competitors in battle. After long seasons of hard work saw the bike more and more competitive and a consistent frontrunner, 2017 saw the Italian challenge for the World Championship down to the wire in Valencia after a stunning six wins across the season. For 2018, he hit the ground running to win the season opener, endured some harder races and then came back swinging - ending the year runner up once again. 2019 began in similar fashion: a win in Qatar. However, a certain Marquez turned up the wick and proved too much for everyone, with Dovizioso claiming nine podiums - including two wins - on his way to P2 in the overall standings for a third year in a row. Many fancied Dovi for the title during 2020, particularly in the absence of the injured Marc Marquez, however, there was to be no dream send off from Ducati for the Italian, who could only earn one victory during the season, at the Austrian GP, soon after announcing he was to leave the Bologna Bullets. He ended the season 4th in the standings and announced his intention to take a sabbatical from the sport. It was short-lived though, as before the start of the 2021 campaign, Aprilia announced he would test their new RS-GP in Jerez over three days in April. After completing some tests with Aprilia, Dovizioso was called up to step in at Petronas Yamaha SRT for the final five races of 2021, with Dovizioso signing a one-year contract to ride a factory YZR-M1 next season. The experienced Italian spearheaded the WithU Yamaha RNF MotoGP Team's efforts in 2022, but unfortunately, he was unable to recapture his from of years gone by. With 24 World Championship victories, 103 podiums and 20 pole positions, the Dovi decided to call it a day in 2022, retiring at his home Grand Prix in Misano in front of a sea of well-wishers.",
            "worldChampionship": "1",
            "victories": "24",
            "podiums": "103",
            "poles": "20",
            "races": "346",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/1f433c18-4955-4492-9554-6deb63d72a72/1pcrNPFn.png?height=675&width=745",
            "name": "Wayne Gardner", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/australia_xfvhb2.png",
            "nationality": "Australia",
            "dateOfBirth": "11/10/1959",
            "placeOfBirth": "Wollongong",
            "story": "Australian Wayne Gardner plied his trade when the 500cc factory bikes were arguably at their hardest to ride and in which the competition in the class involved legendary peers such as Wayne Rainey, Randy Mamola, Kevin Schwantz, Eddie Lawson, Freddie Spencer and Mick Doohan. His 52 podiums, 18 victories and 1987 premier class title win came during one of the toughest decades of competition in the sport. Following his 500cc debut in 1983, Gardner remained loyal to Honda in his eight seasons of World Championship participation - earning a breakthrough thanks to his results for Honda Britain. His first full-time campaign was in 1985 and he won his first Grand Prix in 1986, before successfully battling with Lawson and Mamola to become 1987 World Champion on the NSR500. An ill-handling 1988 version of the NSR often offered sensational images of Gardner wrestling the phenomenally fast machine and he again tussled with Lawson that year but their close duel eventually swung in the favour of the American. The subsequent seasons were wrecked by injury; broken legs, ribs and feet - hindering his riding in 1989, ‘90 and ‘91. Highlights in that period, however, included breath-taking victories at the first Phillip Island GP in 1989 and an even better re-run in 1990; both of which feature amongst the finest races ever seen in the premier class. Gardner retired in 1992, taking an emotional final win at the British Grand Prix that year. As the first ever Australian 500cc World Champion he opened motorcycle racing up to a much wider audience in Australia and is cherished by a generation of fans.",
            "worldChampionship": "1",
            "victories": "18",
            "podiums": "52",
            "poles": "19",
            "races": "103",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/99951dd3-b054-4fb2-8783-62bff4684035/ATz7j1CZ.png?height=675&width=745",
            "name": "Mike Hailwood", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832209/united_kingdom_br45wh.png",
            "nationality": "United Kingdom of Great Britain and Northern Ireland",
            "dateOfBirth": "02/04/1940",
            "placeOfBirth": "Great Milton",
            "story": "Englishman Mike Hailwood won nine World titles across three different classes during the 1960s and took victory 14 times in the Isle of Man TT, including two remarkable wins at the end of the ‘70s after coming out of retirement following an 11-year absence from the competition. Nicknamed Mike-the-Bike, Hailwood won 76 Grands Prix (37 in 500cc, 16 in 350cc, 21 in 250cc and two in 125cc) during a ten year World Championship career which commenced in 1958. In his first Grand Prix season, as a teenager, he tried his hand in three different classes (500cc, 350cc and 250cc) picking up three podiums along the way. Having already won several domestic British championships and a South African national title by the age of 19, in 1959 he became the youngest rider to have won a Grand Prix at that time - as he rode a 125cc Ducati to victory in Ireland. He continued his progression in 1960 on Mondial and Norton machinery, and the following year earned his first World title as he triumphed in the 250cc class on a Honda. Meanwhile, ’61 also saw the start of a highly successful period for Hailwood with MV Agusta with whom he finish runner-up in the 500cc category. In 1962 he won the first of four consecutive premier class titles with the Italian marque, incredibly winning every race he participated in on 500cc machinery from ’62-’65. Following his return to Honda in 1966 he took double World Championship glory (in 250cc and 350cc) that year and the following season, as he was undefeated for two years in the two categories before leaving the Grand Prix scene. Hailwood’s 1967 Isle of Man TT win over youngster and archrival Giacomo Agostini who had replaced him at MV Agusta in 1966 and promptly taken his 500cc crown - came in one of the best contests in the history of racing on the island and was his 12th victory in the world famous event. Hailwood went on to become a respected driver in Formula One, but a horrifying 1974 crash in Germany saw him retire from four-wheel competition due to a badly broken right leg. Defying all odds the English hero returned to the Isle of Man TT in 1978, winning the F1 category on a Ducati 900SS, to trigger ecstatic scenes, before coming back to ride to his 14th and final TT win on a Suzuki the next year. Hailwood tragically passed away following a road accident in March 1981.",
            "worldChampionship": "9",
            "victories": "76",
            "podiums": "116",
            "poles": "-",
            "races": "152",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/be491322-68b0-4c10-a6ba-8a68496e8903/ZuTwHl0s.png?height=675&width=745",
            "name": "Nicky Hayden", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832209/united_kingdom_br45wh.png",
            "nationality": "United States of America",
            "dateOfBirth": "30/07/1981",
            "placeOfBirth": "Owensboro",
            "story": "“Kentucky Kid” Nicky Hayden began his career on dirt before switching to tarmac, winning the AMA Supersport Championship onboard a privateer Honda in 1999. In 2002, he won the AMA Superbike title, the youngest rider ever to do so, and moved up to the MotoGP™ World Championship in 2003, also riding a Honda. Hayden then became the most recent MotoGP™ World Champion from the USA after beating Valentino Rossi to the title in 2006, with the fight going down to the final round in Valencia. He then moved to Ducati in 2009 to partner Casey Stoner, finding the first year a challenge, before making a vast improvement in 2010 to end the season 7th. The Kentucky rider moved back aboard a Honda for the 2014 season, riding the Open specification RCV1000R with Drive M7 Aspar. Major injury problems with his wrist seriously affected the season, resulting in surgery to fix the problem and get back on track for 2015. Named a MotoGP™ legend the same year, the American’s 13th and final season in MotoGP™ was a challenging one ahead of his move to the WorldSBK paddock in 2016. Already a podium finisher multiple times in World Superbike and taking his first win in Sepang in his rookie season, the legendary American returned to MotoGP™ at the Aragon GP to sub for Jack Miller at Estrella Galicia 0,0 Marc VDS, as the Australian recovered from a hand injury. After scoring points in Aragon, Hayden was back once again at Phillip Island - replacing injured former Repsol Honda teammate Dani Pedrosa in the same team. Hayden then tragically lost his life in a cycling accident after the 2017 Italian Round of WorldSBK, when he was training on the Rimini coast. Hayden was a true Champion, for his achievements both on track and off.",
            "worldChampionship": "1",
            "victories": "3",
            "podiums": "28",
            "poles": "5",
            "races": "219",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/d0f77a4b-71e9-46f2-86e0-717912b043e9/FL5e9J7W.png?height=675&width=745",
            "name": "Daijiro Kato", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832208/japan_dcqxpp.png",
            "nationality": "Japan",
            "dateOfBirth": "04/07/1976",
            "placeOfBirth": "Saitama",
            "story": "When 2001 250cc World Champion and 17 time Grand Prix winner Daijiro Kato was taken away from the motorcycling world on April 6th, 2003 at the Suzuka circuit, the sport lost one of its major talents and leading lights. The unassuming and friendly Japanese rider debuted in the World Championship in 1996, taking third in 250cc race at the circuit that would later claim his life. 2001 saw him completely dominate 250cc racing with 11 wins and 13 podiums. At the time of his tragic death, the 26 year old was at the start of his second season in MotoGP having taken two podiums in his maiden campaign in 2002. Kato’s achievements remain an inspiring target while his legacy lives on via safety measures that arrived in MotoGP after his untimely passing.",
            "worldChampionship": "1",
            "victories": "17",
            "podiums": "27",
            "poles": "11",
            "races": "53",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/fbd5951a-35ff-4033-8fad-3913874da126/EDAr17xl.png?height=675&width=745",
            "name": "Eddie Lawson", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832209/united_kingdom_br45wh.png",
            "nationality": "United States of America",
            "dateOfBirth": "11/03/1958",
            "placeOfBirth": "Upland",
            "story": "The neat and consistent multi World Champion Eddie Lawson claimed his four titles in 1984, 1986, 1988 and 1989, in a golden period for American riders. With the last of his successes Lawson became the first rider in the history of the sport to win the title with two different manufacturers in back-to-back seasons. In 1988 he gave Yamaha their fourth championship of the decade - his third in just six seasons - and the following year he immediately won his fourth onboard the Honda NSR500. Lawson entered the World Championship on the back of dirt-track and Superbike recognition in the United States, winning two AMA Superbike and two 250cc titles on the asphalt. His debut 500cc campaign with Yamaha was impressive and he took three podiums in 1983 as team-mate to Kenny Roberts Snr. Indeed 1983 was the first of six years with Yamaha and the title arrived at Lawson’s second attempt with four wins and nine podiums from the 12 rounds in 1984. He went on to earn 31 wins and 78 podiums in a glorious decade of 500cc racing, with perhaps his finest moment being his 1989 triumph over Kevin Schwantz and Wayne Rainey, as he only finished out of the top three twice in the 15 rounds - taking four victories en route. His last season in 1992, at 34 years of age, was notable for his second year with the until-then uncompetitive Cagiva, but Lawson gave the Italian machine its first historic win at a damp Hungary.",
            "worldChampionship": "4",
            "victories": "31",
            "podiums": "78",
            "poles": "18",
            "races": "127",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/96491435-9190-4f47-8577-2002db9b44fe/xK506XsT.png?height=675&width=745",
            "name": "Jorge Lorenzo", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "dateOfBirth": "04/05/1987",
            "placeOfBirth": "Palma de Mallorca",
            "story": "Five-time World Champion Jorge Lorenzo has so far taken three of those crowns in the premier class - in 2010, 2012 and 2015. Graduating to MotoGP™ after back-to-back 250 World Championships, Lorenzo was on pole for his first MotoGP™ race in 2008 and set a new lap record, before winning his third GP at Estoril in his rookie year. Defeating teammate Valentino Rossi in 2010 to take his first MotoGP™ World Championship, Lorenzo then beat Casey Stoner to the crown in 2012 before just losing out to Marc Marquez in 2013 taking the title fight down to the wire in Valencia despite twice breaking his collarbone; famously riding to P5 in Assen the day after surgery. In 2015, the ‘Spartan’ was back to full power and faced down teammate Rossi for the title once again, sealing the Championship with a spectacular win from pole in the final race of the year. 2016 saw Lorenzo third in the Championship with another four victories, including the season finale in Valencia. For 2017, the Mallorcan took on an incredible challenge in a new era of his career: after more than 40 victories and 100 podiums with Yamaha, Lorenzo switched to the Ducati Team. Making progress throughout the year and taking podium finishes, the Spaniard then took his first wins in red in style in 2018, winning at Mugello, Catalunya and the Red Bull Ring. The latter part of the year was then affected by injury and Lorenzo was aiming to recharge and come back even stronger in 2019... as he made a shock switch to the Repsol Honda Team. However, his link up with Marc Marquez was ill-fated as he cut short a two-year deal early by announcing his retirement from the sport in Valencia 2019. The five-time Champion of the World was then inducted as a MotoGP™ Legend in Jerez 2022 as his status as a premier class great was made official.",
            "worldChampionship": "5",
            "victories": "68",
            "podiums": "152",
            "poles": "69",
            "races": "297",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/5422d34b-b152-4309-91f4-44e1d377b738/zB7Mlec8.png?height=675&width=745",
            "name": "Marco Lucchinelli", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "dateOfBirth": "26/06/1954",
            "placeOfBirth": "Bolano",
            "story": "After beginning his career on the world stage in the 350 World Championship in 1975, Marco Lucchinelli burst into the premier class the following year with two podiums in his first two appearances. Fourth in the Championship as a rookie, Lucchinelli’s debut with Suzuki laid solid foundations for his ambitions of taking the World Championship. 1976 ended with a second place in Germany, before the Italian was back on the rostrum in Finland in 1977 and again at Mugello the following season.  1979 was a more difficult season, but a raft of top ten finishes prefaced a real push for the title in 1980. Lucchinelli’s success with Suzuki saw new heights that year, as the partnership took a podium finish five times including a victory to conclude the season in Germany. The Italian was third in the title standings behind Kenny Roberts and Randy Mamola, and the momentum was in motion for 1981. 1981 saw the order of that top three the previous season reversed. Lucchinelli took five stunning wins and seven podiums on his Suzuki, as well as setting five fastest laps and seven pole positions as he marched towards the title. Edging Randy Mamola by 11 points, the Italian was crowned 1981 World Champion to take his place in MotoGP™ history. Lucchinelli took a further two podiums in the 500 World Championship, then riding for Honda, before his switch to WorldSBK for the series’ inaugural season in 1988. Debuting on the podium in Race 1 at Donington Park in the first ever meeting, Lucchinelli then won the second race that weekend to make another bit of history as he joined the exclusive club of riders to have won in both Grand Prix racing and WorldSBK in fact founding that club as the first rider to achieve the feat.",
            "worldChampionship": "1",
            "victories": "6",
            "podiums": "19",
            "poles": "9",
            "races": "76",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/5442490b-5e2a-4379-88cb-ff25fa42f754/Xe1pSRuG.png?height=675&width=745",
            "name": "Randy Mamola", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832209/united_states_dewfvl.png",
            "nationality": "United States of America",
            "dateOfBirth": "10/11/1959",
            "placeOfBirth": "San Jose, California",
            "story": "Randy Mamola began his career on the world stage in 1979, bursting onto the scene with podiums in both the 250 and 500 World Championships. The following season, the American took his first wins two 500 Grand Prix victories for Suzuki and added a further pair of podiums in the premier class to end the year runner up in the title fight. 1981 saw Mamola on the top step twice more with even more visits to the podium, once more second in the Championship, before a slightly more difficult 1982. In 1983 Mamola took third overall as Freddie Spencer and Kenny Roberts dueled at the top, before a switch to Honda for the 1984 season saw him back in the fight and runner up in the Championship once again. After another win in 1985 and one of the most spectacular saves in history, Mamola then moved to Yamaha for 1986 and took yet more wins and podiums before another impressive 1987 campaign saw the American crowned runner up for the fourth time. Mamola finally retired from Grand Prix racing at the end of 1992, after another two podiums, with 13 wins and 57 podiums accrued in his career. 2018 marks the 39th year the American will be in the Grand Prix motorcycle racing paddock, however, Mamola having remained a key figure in the sport beyond competing on track.",
            "worldChampionship": "0",
            "victories": "13",
            "podiums": "57",
            "poles": "5",
            "races": "153",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/09584f77-49ef-4a74-8f5d-294917f4f35c/2LC5WItO.png?height=675&width=745",
            "name": "Jorge Martínez Aspar", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "dateOfBirth": "29/08/1962",
            "placeOfBirth": "Alzira",
            "story": "Jorge Martínez Salvadores (Alcira, Valencia, 29 de agosto de 1962), conocido como Jorge Martínez Aspar, es un expiloto de motociclismo español. Fue tres veces campeón del mundo de 80 cc, en 1986, 1987 y 1988 con Derbi, y una vez de 125 cc en 1988, repitiendo con Derbi. Es el cuarto piloto español más laureado del Campeonato del Mundo de Motociclismo, tras Ángel Nieto, Marc Márquez y Jorge Lorenzo. Ha servido de puente, junto con Sito Pons, a la posterior generación de pilotos españoles, encabezada por Alex Crivillé.",
            "worldChampionship": "4",
            "victories": "37",
            "podiums": "61",
            "poles": "19",
            "races": "197",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/9528c8ce-87fe-45fa-b11c-5d74407bb5f6/6CV4GFbr.png?height=675&width=745",
            "name": "Angel Nieto", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "dateOfBirth": "25/01/1947",
            "placeOfBirth": "Zamora",
            "story": "Angel Nieto established Spain as a motorcycling force with 13 World Championships, 90 Grand Prix wins and 139 podiums, in the 50cc, 80cc and 125cc classes over almost two decades from 1967 to 1986. A superstitious Legend, the rider from Zamora always referred to the number of his titles as 12 + 1. Nieto’s sheer dominance in the smaller classes mean that his achievements regularly place him up with the likes of Giacomo Agostini, Valentino Rossi, Mike Hailwood and Phil Read as one of the finest and most skillful riders ever to have graced the world stage. With six World Championships in the 50cc class and seven on 125cc machinery, Nieto also holds the record of earning the most titles with different manufacturers - five in total: Derbi, Bultaco, Garelli, Minarelli and Kreidler. In addition to his Grand Prix success, Nieto gained Spanish Championships in every conceivable class from 50cc up to 750cc. His easy character and joviality made him a popular figure and encapsulated the cavalier spirit that defined the sport in the late 1960s and '70s. Later head of a motorcycling dynasty as family members followed the Legend’s path into the world of two wheels, Nieto then sadly passed away in 2017 following a quad bike accident in Ibiza. He was 70 years old.",
            "worldChampionship": "12+1",
            "victories": "90",
            "podiums": "139",
            "poles": "21",
            "races": "176",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/0eefa3e5-c084-4e46-842f-0da673e6a1a0/8kBvnr0n.png?height=675&width=745",
            "name": "Dani Pedrosa", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1703102384/ironhack/test/eaum1o3v0vmqtwgtkopt.png",
            "nationality": "Spain",
            "dateOfBirth": "29/09/1985",
            "placeOfBirth": "Sabadell",
            "story": "Dani Pedrosa finished third in the 125 World Championship in 2002 before taking the title the year after with time to spare. Moving up to the 250 World Championship the following year, Pedrosa then won that crown as a rookie and subsequently defended it despite suffering with injury. The Spaniard then moved up to MotoGP™ in 2006 and took two wins in his rookie year, including his fourth ever race in the class. A consistent frontrunner and title challenger, including taking the most wins in MotoGP™ in 2012, Pedrosa’s career has been plagued by some injuries – but the Sabadell native won at least one Grand Prix in every season of his career since 2002. In 2014, Pedrosa suffered problems with arm pump and early the following season underwent major, career-saving surgery. Finishing the year on a high with two spectacular wins once back to full strength, the Spaniard also won in Misano in 2016 after a tough season. Breaking his collarbone in Motegi, the 3-time World Champion was back to full strength for 2017 and kept his incredible record of at least one win a year rolling, taking victory in Jerez and Valencia. 2018 would prove the Spaniard's final season as a MotoGP™ racer, as he called it a day after failing to register a win or podium finish all year. Having ended his long association with Honda, Pedrosa soon signed a deal with KTM to take on the role of test rider and has proved instrumental in the Austrian manufacturer’s rise towards premier class wins and podiums. The Spaniard made his first wildcard appearance on the RC16 at the 2021 Styrian GP, and he'll once again line up on the grid at the 2023 Spanish GP with KTM - at his beloved Jerez.",
            "worldChampionship": "3",
            "victories": "54",
            "podiums": "153",
            "poles": "49",
            "races": "298",
            "legend": "true"
        },
        { 
            "image": "https://resources.motogp.pulselive.com/photo-resources/2023/06/15/14e88435-d576-4111-8aad-939b82e0886c/2hYMs04o.png?height=675&width=745",
            "name": "Giacomo Agostini", 
            "flag": "https://res.cloudinary.com/dwahroldl/image/upload/v1704832207/italy_s2ktqm.png",
            "nationality": "Italy",
            "dateOfBirth": "16/06/1942",
            "placeOfBirth": "Brescia",
            "story": "Giacomo Agostini is widely regarded as the best rider of all time and his spectacular career in the second half of the 1960s and first part of the 1970s saw him become the first true World star of motorcycle racing. During his 14 years in the World Championship the sensational Italian won 15 titles (eight in 500cc and seven in 350cc), earning a remarkable total of 122 Grand Prix victories along the way. He very rarely crashed and was the dominant force on both 350cc and 500cc machinery for most of his racing life. Making his name in European hillclimb events Agostini made two World Championship appearances for the Morini team in 1964 in the 250cc class and was recruited by MV Agusta for a full time ride the following year, as understudy to Mike Hailwood on 350cc and 500cc bikes. He enjoyed race wins in both classes during that first season with MV Agusta and was runner-up in both categories, but it would not be long before he became a World Champion for the first time - as he secured the 500cc crown in the last race of 1966. History repeated itself in 1967 as Agostini was second in the 350cc championship and the 500cc title-winner again at the last round of the season. Honda's 1967 departure from Grands Prix marked the beginning of a golden period for MV Augusta with Agostini taking double World title glory for the Italian marque (in the 350cc and 500cc classes) for five consecutive season from 1968 to 1972, in an incredible period of total domination. In 1973, he took the 350cc title again, the last of his 13 championships with MV Augusta, whilst his team-mate Phil Read ended his 500cc title winning sequence. Moving to Yamaha for the 1974 season, Agostini won the Daytona 200 event early that year, beating the likes of Kenny Roberts Snr., for his first taste of glory on Japanese machinery (a triumph he backed up for the Far Eastern manufacturers with the 1974 350cc crown and his final World title in 1975 on 500cc machinery. The brilliant Italian undertook his final season in 1977, having recorded Grand Prix victories in both the 350cc and 500cc classes the previous year) his last ever race win coming at Germany's Nurburgring in 1976.",
            "worldChampionship": "15",
            "victories": "122",
            "podiums": "159",
            "poles": "6",
            "races": "207",
            "legend": "true" 
        }
    ]
}